01_cases/vrfb_elec_tailor_ft_1pz/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porous
{
    type            DarcyForchheimer;
    active          yes;
    cellZone        porous;

    DarcyForchheimerCoeffs
    {
        d   (3.7e10     3.7e10      3.7e10);
        f   (0 0 0);

        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);

            coordinateRotation
            {
                type    axesRotation;
                e1      (1 0 0);    
                e2      (0 1 0);
            }
        }
    }
}
/*
tailor
{
    type            DarcyForchheimer;
    active          yes;
    cellZone        tailor;

    DarcyForchheimerCoeffs
    {
        d   (0 0 0);
        f   (0 0 0);

        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);

            coordinateRotation
            {
                type    axesRotation;
                e1      (1 0 0);    
                e2      (0 1 0);
            }
        }
    }
}
*/


// ************************************************************************* //
